espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/ledc_reg.h
/** LEDC_CH6_CONF1_REG register
 *  Configuration register 1 for channel 6
 */
#define LEDC_CH6_CONF1_REG (DR_REG_LEDC_BASE + 0x84)
/** LEDC_DUTY_START_CH6 : R/W/SC; bitpos: [31]; default: 0;
 *  Configures whether the duty cycle fading configurations take effect.
 *  0: Not take effect
 *  1: Take effect
 */
#define LEDC_DUTY_START_CH6    (BIT(31))
#define LEDC_DUTY_START_CH6_M  (LEDC_DUTY_START_CH6_V << LEDC_DUTY_START_CH6_S)
#define LEDC_DUTY_START_CH6_V  0x00000001U
#define LEDC_DUTY_START_CH6_S  31

/** LEDC_CH6_DUTY_R_REG register
 *  Current duty cycle register for channel 6
 */
#define LEDC_CH6_DUTY_R_REG (DR_REG_LEDC_BASE + 0x88)
/** LEDC_DUTY_CH6_R : RO; bitpos: [24:0]; default: 0;
 *  Represents the current duty of output signal on channel 6.
 */
#define LEDC_DUTY_CH6_R    0x01FFFFFFU
#define LEDC_DUTY_CH6_R_M  (LEDC_DUTY_CH6_R_V << LEDC_DUTY_CH6_R_S)
#define LEDC_DUTY_CH6_R_V  0x01FFFFFFU
#define LEDC_DUTY_CH6_R_S  0

/** LEDC_CH7_CONF0_REG register
 *  Configuration register 0 for channel 7
 */
#define LEDC_CH7_CONF0_REG (DR_REG_LEDC_BASE + 0x8c)
/** LEDC_TIMER_SEL_CH7 : R/W; bitpos: [1:0]; default: 0;
 *  Configures which timer is channel 7 selected.
 *  0: Select timer0
 *  1: Select timer1
 *  2: Select timer2
 *  3: Select timer3
 */
#define LEDC_TIMER_SEL_CH7    0x00000003U
#define LEDC_TIMER_SEL_CH7_M  (LEDC_TIMER_SEL_CH7_V << LEDC_TIMER_SEL_CH7_S)
#define LEDC_TIMER_SEL_CH7_V  0x00000003U
#define LEDC_TIMER_SEL_CH7_S  0
/** LEDC_SIG_OUT_EN_CH7 : R/W; bitpos: [2]; default: 0;
 *  Configures whether or not to enable signal output on channel 7.
 *  0: Signal output disable
 *  1: Signal output enable
 */
#define LEDC_SIG_OUT_EN_CH7    (BIT(2))
#define LEDC_SIG_OUT_EN_CH7_M  (LEDC_SIG_OUT_EN_CH7_V << LEDC_SIG_OUT_EN_CH7_S)
#define LEDC_SIG_OUT_EN_CH7_V  0x00000001U
#define LEDC_SIG_OUT_EN_CH7_S  2
/** LEDC_IDLE_LV_CH7 : R/W; bitpos: [3]; default: 0;
 *  Configures the output value when channel 7 is inactive. Valid only when
 *  LEDC_SIG_OUT_EN_CH7 is 0.
 *  0: Output level is low
 *  1: Output level is high
 */
#define LEDC_IDLE_LV_CH7    (BIT(3))
#define LEDC_IDLE_LV_CH7_M  (LEDC_IDLE_LV_CH7_V << LEDC_IDLE_LV_CH7_S)
#define LEDC_IDLE_LV_CH7_V  0x00000001U
#define LEDC_IDLE_LV_CH7_S  3
/** LEDC_PARA_UP_CH7 : WT; bitpos: [4]; default: 0;
 *  Configures whether or not to update LEDC_HPOINT_CH7, LEDC_DUTY_START_CH7,
 *  LEDC_SIG_OUT_EN_CH7, LEDC_TIMER_SEL_CH7, LEDC_DUTY_NUM_CH7, LEDC_DUTY_CYCLE_CH7,
 *  LEDC_DUTY_SCALE_CH7, LEDC_DUTY_INC_CH7, and LEDC_OVF_CNT_EN_CH7 fields for channel
 *  7, and will be automatically cleared by hardware.
 *  0: Invalid. No effect
 *  1: Update
 */
#define LEDC_PARA_UP_CH7    (BIT(4))
#define LEDC_PARA_UP_CH7_M  (LEDC_PARA_UP_CH7_V << LEDC_PARA_UP_CH7_S)
#define LEDC_PARA_UP_CH7_V  0x00000001U
#define LEDC_PARA_UP_CH7_S  4
/** LEDC_OVF_NUM_CH7 : R/W; bitpos: [14:5]; default: 0;
 *  Configures the maximum times of overflow minus 1.The LEDC_OVF_CNT_CH7_INT interrupt
 *  will be triggered when channel 7 overflows for (LEDC_OVF_NUM_CH7 + 1) times.
 */
#define LEDC_OVF_NUM_CH7    0x000003FFU
#define LEDC_OVF_NUM_CH7_M  (LEDC_OVF_NUM_CH7_V << LEDC_OVF_NUM_CH7_S)
#define LEDC_OVF_NUM_CH7_V  0x000003FFU
#define LEDC_OVF_NUM_CH7_S  5
/** LEDC_OVF_CNT_EN_CH7 : R/W; bitpos: [15]; default: 0;
 *  Configures whether or not to enable the ovf_cnt of channel 7.
 *  0: Disable
 *  1: Enable
 */
#define LEDC_OVF_CNT_EN_CH7    (BIT(15))
#define LEDC_OVF_CNT_EN_CH7_M  (LEDC_OVF_CNT_EN_CH7_V << LEDC_OVF_CNT_EN_CH7_S)
#define LEDC_OVF_CNT_EN_CH7_V  0x00000001U
#define LEDC_OVF_CNT_EN_CH7_S  15
/** LEDC_OVF_CNT_RESET_CH7 : WT; bitpos: [16]; default: 0;
 *  Configures whether or not to reset the  ovf_cnt of channel 7.
 *  0: Invalid. No effect
 *  1: Reset the ovf_cnt
 */
#define LEDC_OVF_CNT_RESET_CH7    (BIT(16))
#define LEDC_OVF_CNT_RESET_CH7_M  (LEDC_OVF_CNT_RESET_CH7_V << LEDC_OVF_CNT_RESET_CH7_S)
#define LEDC_OVF_CNT_RESET_CH7_V  0x00000001U
#define LEDC_OVF_CNT_RESET_CH7_S  16

/** LEDC_CH7_HPOINT_REG register
 *  High point register for channel 7
 */
#define LEDC_CH7_HPOINT_REG (DR_REG_LEDC_BASE + 0x90)
/** LEDC_HPOINT_CH7 : R/W; bitpos: [19:0]; default: 0;
 *  Configures high point of signal output on channel 7. The output value changes to
 *  high when the selected timers has reached the value specified by this register.
 */
#define LEDC_HPOINT_CH7    0x000FFFFFU
#define LEDC_HPOINT_CH7_M  (LEDC_HPOINT_CH7_V << LEDC_HPOINT_CH7_S)
#define LEDC_HPOINT_CH7_V  0x000FFFFFU
#define LEDC_HPOINT_CH7_S  0

/** LEDC_CH7_DUTY_REG register
 *  Initial duty cycle register for channel 7
 */
#define LEDC_CH7_DUTY_REG (DR_REG_LEDC_BASE + 0x94)
/** LEDC_DUTY_CH7 : R/W; bitpos: [24:0]; default: 0;
 *  Configures the duty of signal output on channel 7.
 */
#define LEDC_DUTY_CH7    0x01FFFFFFU
#define LEDC_DUTY_CH7_M  (LEDC_DUTY_CH7_V << LEDC_DUTY_CH7_S)
#define LEDC_DUTY_CH7_V  0x01FFFFFFU
#define LEDC_DUTY_CH7_S  0

/** LEDC_CH7_CONF1_REG register
 *  Configuration register 1 for channel 7
 */
#define LEDC_CH7_CONF1_REG (DR_REG_LEDC_BASE + 0x98)
/** LEDC_DUTY_START_CH7 : R/W/SC; bitpos: [31]; default: 0;
 *  Configures whether the duty cycle fading configurations take effect.
 *  0: Not take effect
 *  1: Take effect
 */
#define LEDC_DUTY_START_CH7    (BIT(31))
#define LEDC_DUTY_START_CH7_M  (LEDC_DUTY_START_CH7_V << LEDC_DUTY_START_CH7_S)
#define LEDC_DUTY_START_CH7_V  0x00000001U
#define LEDC_DUTY_START_CH7_S  31

/** LEDC_CH7_DUTY_R_REG register
 *  Current duty cycle register for channel 7
 */
#define LEDC_CH7_DUTY_R_REG (DR_REG_LEDC_BASE + 0x9c)
/** LEDC_DUTY_CH7_R : RO; bitpos: [24:0]; default: 0;
 *  Represents the current duty of output signal on channel 7.
 */
#define LEDC_DUTY_CH7_R    0x01FFFFFFU
#define LEDC_DUTY_CH7_R_M  (LEDC_DUTY_CH7_R_V << LEDC_DUTY_CH7_R_S)
#define LEDC_DUTY_CH7_R_V  0x01FFFFFFU
#define LEDC_DUTY_CH7_R_S  0

/** LEDC_TIMER0_CONF_REG register
 *  Timer 0 configuration register
 */
#define LEDC_TIMER0_CONF_REG (DR_REG_LEDC_BASE + 0xa0)
/** LEDC_TIMER0_DUTY_RES : R/W; bitpos: [4:0]; default: 0;
 *  Configures the range of the counter in timer 0.
 */
#define LEDC_TIMER0_DUTY_RES    0x0000001FU
#define LEDC_TIMER0_DUTY_RES_M  (LEDC_TIMER0_DUTY_RES_V << LEDC_TIMER0_DUTY_RES_S)
#define LEDC_TIMER0_DUTY_RES_V  0x0000001FU
#define LEDC_TIMER0_DUTY_RES_S  0
/** LEDC_CLK_DIV_TIMER0 : R/W; bitpos: [22:5]; default: 0;
 *  Configures the divisor for the divider in timer 0.The least significant eight bits
 *  represent the fractional part.
 */
#define LEDC_CLK_DIV_TIMER0    0x0003FFFFU
#define LEDC_CLK_DIV_TIMER0_M  (LEDC_CLK_DIV_TIMER0_V << LEDC_CLK_DIV_TIMER0_S)
#define LEDC_CLK_DIV_TIMER0_V  0x0003FFFFU
#define LEDC_CLK_DIV_TIMER0_S  5
/** LEDC_TIMER0_PAUSE : R/W; bitpos: [23]; default: 0;
 *  Configures whether or not to pause the counter in timer 0.
 *  0: Normal
 *  1: Pause
 */
#define LEDC_TIMER0_PAUSE    (BIT(23))
#define LEDC_TIMER0_PAUSE_M  (LEDC_TIMER0_PAUSE_V << LEDC_TIMER0_PAUSE_S)
#define LEDC_TIMER0_PAUSE_V  0x00000001U
#define LEDC_TIMER0_PAUSE_S  23
/** LEDC_TIMER0_RST : R/W; bitpos: [24]; default: 1;
 *  Configures whether or not to reset timer 0. The counter will show 0 after reset.
 *  0: Not reset
 *  1: Reset
 */
#define LEDC_TIMER0_RST    (BIT(24))
#define LEDC_TIMER0_RST_M  (LEDC_TIMER0_RST_V << LEDC_TIMER0_RST_S)
#define LEDC_TIMER0_RST_V  0x00000001U
#define LEDC_TIMER0_RST_S  24
/** LEDC_TIMER0_PARA_UP : WT; bitpos: [26]; default: 0;
 *  Configures whether or not to update LEDC_CLK_DIV_TIMER0 and LEDC_TIMER0_DUTY_RES.
 *  0: Invalid. No effect
 *  1: Update
 */
#define LEDC_TIMER0_PARA_UP    (BIT(26))
#define LEDC_TIMER0_PARA_UP_M  (LEDC_TIMER0_PARA_UP_V << LEDC_TIMER0_PARA_UP_S)
#define LEDC_TIMER0_PARA_UP_V  0x00000001U
#define LEDC_TIMER0_PARA_UP_S  26

/** LEDC_TIMER0_VALUE_REG register
 *  Timer 0 current counter value register
 */
#define LEDC_TIMER0_VALUE_REG (DR_REG_LEDC_BASE + 0xa4)
/** LEDC_TIMER0_CNT : RO; bitpos: [19:0]; default: 0;
 *  Represents the current counter value of timer 0.
 */
#define LEDC_TIMER0_CNT    0x000FFFFFU
#define LEDC_TIMER0_CNT_M  (LEDC_TIMER0_CNT_V << LEDC_TIMER0_CNT_S)
#define LEDC_TIMER0_CNT_V  0x000FFFFFU
#define LEDC_TIMER0_CNT_S  0

/** LEDC_TIMER1_CONF_REG register
 *  Timer 1 configuration register
 */
#define LEDC_TIMER1_CONF_REG (DR_REG_LEDC_BASE + 0xa8)
/** LEDC_TIMER1_DUTY_RES : R/W; bitpos: [4:0]; default: 0;
 *  Configures the range of the counter in timer 1.
 */
#define LEDC_TIMER1_DUTY_RES    0x0000001FU
#define LEDC_TIMER1_DUTY_RES_M  (LEDC_TIMER1_DUTY_RES_V << LEDC_TIMER1_DUTY_RES_S)
#define LEDC_TIMER1_DUTY_RES_V  0x0000001FU
#define LEDC_TIMER1_DUTY_RES_S  0
/** LEDC_CLK_DIV_TIMER1 : R/W; bitpos: [22:5]; default: 0;
 *  Configures the divisor for the divider in timer 1.The least significant eight bits
 *  represent the fractional part.
 */
#define LEDC_CLK_DIV_TIMER1    0x0003FFFFU
#define LEDC_CLK_DIV_TIMER1_M  (LEDC_CLK_DIV_TIMER1_V << LEDC_CLK_DIV_TIMER1_S)
#define LEDC_CLK_DIV_TIMER1_V  0x0003FFFFU
#define LEDC_CLK_DIV_TIMER1_S  5
/** LEDC_TIMER1_PAUSE : R/W; bitpos: [23]; default: 0;
 *  Configures whether or not to pause the counter in timer 1.
 *  0: Normal
 *  1: Pause
 */
#define LEDC_TIMER1_PAUSE    (BIT(23))
#define LEDC_TIMER1_PAUSE_M  (LEDC_TIMER1_PAUSE_V << LEDC_TIMER1_PAUSE_S)
#define LEDC_TIMER1_PAUSE_V  0x00000001U
#define LEDC_TIMER1_PAUSE_S  23
/** LEDC_TIMER1_RST : R/W; bitpos: [24]; default: 1;
 *  Configures whether or not to reset timer 1. The counter will show 0 after reset.
 *  0: Not reset
 *  1: Reset
 */
#define LEDC_TIMER1_RST    (BIT(24))
#define LEDC_TIMER1_RST_M  (LEDC_TIMER1_RST_V << LEDC_TIMER1_RST_S)
#define LEDC_TIMER1_RST_V  0x00000001U
#define LEDC_TIMER1_RST_S  24
/** LEDC_TIMER1_PARA_UP : WT; bitpos: [26]; default: 0;
 *  Configures whether or not to update LEDC_CLK_DIV_TIMER1 and LEDC_TIMER1_DUTY_RES.
 *  0: Invalid. No effect
 *  1: Update
 */
#define LEDC_TIMER1_PARA_UP    (BIT(26))
#define LEDC_TIMER1_PARA_UP_M  (LEDC_TIMER1_PARA_UP_V << LEDC_TIMER1_PARA_UP_S)
#define LEDC_TIMER1_PARA_UP_V  0x00000001U
#define LEDC_TIMER1_PARA_UP_S  26

