espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/ledc_reg.h
#define LEDC_CH3_GAMMA_RANGE2_REG  (DR_REG_LEDC_BASE + 0x4c8)
/* LEDC_CH3_GAMMA_RANGE2_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH3_GAMMA_RANGE2_DUTY_NUM    0x000003FF
#define LEDC_CH3_GAMMA_RANGE2_DUTY_NUM_M  ((LEDC_CH3_GAMMA_RANGE2_DUTY_NUM_V)<<(LEDC_CH3_GAMMA_RANGE2_DUTY_NUM_S))
#define LEDC_CH3_GAMMA_RANGE2_DUTY_NUM_V  0x3FF
#define LEDC_CH3_GAMMA_RANGE2_DUTY_NUM_S  21
/* LEDC_CH3_GAMMA_RANGE2_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH3_GAMMA_RANGE2_SCALE    0x000003FF
#define LEDC_CH3_GAMMA_RANGE2_SCALE_M  ((LEDC_CH3_GAMMA_RANGE2_SCALE_V)<<(LEDC_CH3_GAMMA_RANGE2_SCALE_S))
#define LEDC_CH3_GAMMA_RANGE2_SCALE_V  0x3FF
#define LEDC_CH3_GAMMA_RANGE2_SCALE_S  11
/* LEDC_CH3_GAMMA_RANGE2_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH3_GAMMA_RANGE2_DUTY_CYCLE    0x000003FF
#define LEDC_CH3_GAMMA_RANGE2_DUTY_CYCLE_M  ((LEDC_CH3_GAMMA_RANGE2_DUTY_CYCLE_V)<<(LEDC_CH3_GAMMA_RANGE2_DUTY_CYCLE_S))
#define LEDC_CH3_GAMMA_RANGE2_DUTY_CYCLE_V  0x3FF
#define LEDC_CH3_GAMMA_RANGE2_DUTY_CYCLE_S  1
/* LEDC_CH3_GAMMA_RANGE2_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH3_GAMMA_RANGE2_DUTY_INC    (BIT(0))
#define LEDC_CH3_GAMMA_RANGE2_DUTY_INC_M  (BIT(0))
#define LEDC_CH3_GAMMA_RANGE2_DUTY_INC_V  0x1
#define LEDC_CH3_GAMMA_RANGE2_DUTY_INC_S  0

#define LEDC_CH3_GAMMA_RANGE3_REG  (DR_REG_LEDC_BASE + 0x4cc)
/* LEDC_CH3_GAMMA_RANGE3_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH3_GAMMA_RANGE3_DUTY_NUM    0x000003FF
#define LEDC_CH3_GAMMA_RANGE3_DUTY_NUM_M  ((LEDC_CH3_GAMMA_RANGE3_DUTY_NUM_V)<<(LEDC_CH3_GAMMA_RANGE3_DUTY_NUM_S))
#define LEDC_CH3_GAMMA_RANGE3_DUTY_NUM_V  0x3FF
#define LEDC_CH3_GAMMA_RANGE3_DUTY_NUM_S  21
/* LEDC_CH3_GAMMA_RANGE3_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH3_GAMMA_RANGE3_SCALE    0x000003FF
#define LEDC_CH3_GAMMA_RANGE3_SCALE_M  ((LEDC_CH3_GAMMA_RANGE3_SCALE_V)<<(LEDC_CH3_GAMMA_RANGE3_SCALE_S))
#define LEDC_CH3_GAMMA_RANGE3_SCALE_V  0x3FF
#define LEDC_CH3_GAMMA_RANGE3_SCALE_S  11
/* LEDC_CH3_GAMMA_RANGE3_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH3_GAMMA_RANGE3_DUTY_CYCLE    0x000003FF
#define LEDC_CH3_GAMMA_RANGE3_DUTY_CYCLE_M  ((LEDC_CH3_GAMMA_RANGE3_DUTY_CYCLE_V)<<(LEDC_CH3_GAMMA_RANGE3_DUTY_CYCLE_S))
#define LEDC_CH3_GAMMA_RANGE3_DUTY_CYCLE_V  0x3FF
#define LEDC_CH3_GAMMA_RANGE3_DUTY_CYCLE_S  1
/* LEDC_CH3_GAMMA_RANGE3_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH3_GAMMA_RANGE3_DUTY_INC    (BIT(0))
#define LEDC_CH3_GAMMA_RANGE3_DUTY_INC_M  (BIT(0))
#define LEDC_CH3_GAMMA_RANGE3_DUTY_INC_V  0x1
#define LEDC_CH3_GAMMA_RANGE3_DUTY_INC_S  0

#define LEDC_CH3_GAMMA_RANGE4_REG  (DR_REG_LEDC_BASE + 0x4d0)
/* LEDC_CH3_GAMMA_RANGE4_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH3_GAMMA_RANGE4_DUTY_NUM    0x000003FF
#define LEDC_CH3_GAMMA_RANGE4_DUTY_NUM_M  ((LEDC_CH3_GAMMA_RANGE4_DUTY_NUM_V)<<(LEDC_CH3_GAMMA_RANGE4_DUTY_NUM_S))
#define LEDC_CH3_GAMMA_RANGE4_DUTY_NUM_V  0x3FF
#define LEDC_CH3_GAMMA_RANGE4_DUTY_NUM_S  21
/* LEDC_CH3_GAMMA_RANGE4_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH3_GAMMA_RANGE4_SCALE    0x000003FF
#define LEDC_CH3_GAMMA_RANGE4_SCALE_M  ((LEDC_CH3_GAMMA_RANGE4_SCALE_V)<<(LEDC_CH3_GAMMA_RANGE4_SCALE_S))
#define LEDC_CH3_GAMMA_RANGE4_SCALE_V  0x3FF
#define LEDC_CH3_GAMMA_RANGE4_SCALE_S  11
/* LEDC_CH3_GAMMA_RANGE4_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH3_GAMMA_RANGE4_DUTY_CYCLE    0x000003FF
#define LEDC_CH3_GAMMA_RANGE4_DUTY_CYCLE_M  ((LEDC_CH3_GAMMA_RANGE4_DUTY_CYCLE_V)<<(LEDC_CH3_GAMMA_RANGE4_DUTY_CYCLE_S))
#define LEDC_CH3_GAMMA_RANGE4_DUTY_CYCLE_V  0x3FF
#define LEDC_CH3_GAMMA_RANGE4_DUTY_CYCLE_S  1
/* LEDC_CH3_GAMMA_RANGE4_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH3_GAMMA_RANGE4_DUTY_INC    (BIT(0))
#define LEDC_CH3_GAMMA_RANGE4_DUTY_INC_M  (BIT(0))
#define LEDC_CH3_GAMMA_RANGE4_DUTY_INC_V  0x1
#define LEDC_CH3_GAMMA_RANGE4_DUTY_INC_S  0

#define LEDC_CH3_GAMMA_RANGE5_REG  (DR_REG_LEDC_BASE + 0x4d4)
/* LEDC_CH3_GAMMA_RANGE5_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH3_GAMMA_RANGE5_DUTY_NUM    0x000003FF
#define LEDC_CH3_GAMMA_RANGE5_DUTY_NUM_M  ((LEDC_CH3_GAMMA_RANGE5_DUTY_NUM_V)<<(LEDC_CH3_GAMMA_RANGE5_DUTY_NUM_S))
#define LEDC_CH3_GAMMA_RANGE5_DUTY_NUM_V  0x3FF
#define LEDC_CH3_GAMMA_RANGE5_DUTY_NUM_S  21
/* LEDC_CH3_GAMMA_RANGE5_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH3_GAMMA_RANGE5_SCALE    0x000003FF
#define LEDC_CH3_GAMMA_RANGE5_SCALE_M  ((LEDC_CH3_GAMMA_RANGE5_SCALE_V)<<(LEDC_CH3_GAMMA_RANGE5_SCALE_S))
#define LEDC_CH3_GAMMA_RANGE5_SCALE_V  0x3FF
#define LEDC_CH3_GAMMA_RANGE5_SCALE_S  11
/* LEDC_CH3_GAMMA_RANGE5_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH3_GAMMA_RANGE5_DUTY_CYCLE    0x000003FF
#define LEDC_CH3_GAMMA_RANGE5_DUTY_CYCLE_M  ((LEDC_CH3_GAMMA_RANGE5_DUTY_CYCLE_V)<<(LEDC_CH3_GAMMA_RANGE5_DUTY_CYCLE_S))
#define LEDC_CH3_GAMMA_RANGE5_DUTY_CYCLE_V  0x3FF
#define LEDC_CH3_GAMMA_RANGE5_DUTY_CYCLE_S  1
/* LEDC_CH3_GAMMA_RANGE5_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH3_GAMMA_RANGE5_DUTY_INC    (BIT(0))
#define LEDC_CH3_GAMMA_RANGE5_DUTY_INC_M  (BIT(0))
#define LEDC_CH3_GAMMA_RANGE5_DUTY_INC_V  0x1
#define LEDC_CH3_GAMMA_RANGE5_DUTY_INC_S  0

#define LEDC_CH3_GAMMA_RANGE6_REG  (DR_REG_LEDC_BASE + 0x4d8)
/* LEDC_CH3_GAMMA_RANGE6_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH3_GAMMA_RANGE6_DUTY_NUM    0x000003FF
#define LEDC_CH3_GAMMA_RANGE6_DUTY_NUM_M  ((LEDC_CH3_GAMMA_RANGE6_DUTY_NUM_V)<<(LEDC_CH3_GAMMA_RANGE6_DUTY_NUM_S))
#define LEDC_CH3_GAMMA_RANGE6_DUTY_NUM_V  0x3FF
#define LEDC_CH3_GAMMA_RANGE6_DUTY_NUM_S  21
/* LEDC_CH3_GAMMA_RANGE6_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH3_GAMMA_RANGE6_SCALE    0x000003FF
#define LEDC_CH3_GAMMA_RANGE6_SCALE_M  ((LEDC_CH3_GAMMA_RANGE6_SCALE_V)<<(LEDC_CH3_GAMMA_RANGE6_SCALE_S))
#define LEDC_CH3_GAMMA_RANGE6_SCALE_V  0x3FF
#define LEDC_CH3_GAMMA_RANGE6_SCALE_S  11
/* LEDC_CH3_GAMMA_RANGE6_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH3_GAMMA_RANGE6_DUTY_CYCLE    0x000003FF
#define LEDC_CH3_GAMMA_RANGE6_DUTY_CYCLE_M  ((LEDC_CH3_GAMMA_RANGE6_DUTY_CYCLE_V)<<(LEDC_CH3_GAMMA_RANGE6_DUTY_CYCLE_S))
#define LEDC_CH3_GAMMA_RANGE6_DUTY_CYCLE_V  0x3FF
#define LEDC_CH3_GAMMA_RANGE6_DUTY_CYCLE_S  1
/* LEDC_CH3_GAMMA_RANGE6_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH3_GAMMA_RANGE6_DUTY_INC    (BIT(0))
#define LEDC_CH3_GAMMA_RANGE6_DUTY_INC_M  (BIT(0))
#define LEDC_CH3_GAMMA_RANGE6_DUTY_INC_V  0x1
#define LEDC_CH3_GAMMA_RANGE6_DUTY_INC_S  0

#define LEDC_CH3_GAMMA_RANGE7_REG  (DR_REG_LEDC_BASE + 0x4dc)
/* LEDC_CH3_GAMMA_RANGE7_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH3_GAMMA_RANGE7_DUTY_NUM    0x000003FF
#define LEDC_CH3_GAMMA_RANGE7_DUTY_NUM_M  ((LEDC_CH3_GAMMA_RANGE7_DUTY_NUM_V)<<(LEDC_CH3_GAMMA_RANGE7_DUTY_NUM_S))
#define LEDC_CH3_GAMMA_RANGE7_DUTY_NUM_V  0x3FF
#define LEDC_CH3_GAMMA_RANGE7_DUTY_NUM_S  21
/* LEDC_CH3_GAMMA_RANGE7_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH3_GAMMA_RANGE7_SCALE    0x000003FF
#define LEDC_CH3_GAMMA_RANGE7_SCALE_M  ((LEDC_CH3_GAMMA_RANGE7_SCALE_V)<<(LEDC_CH3_GAMMA_RANGE7_SCALE_S))
#define LEDC_CH3_GAMMA_RANGE7_SCALE_V  0x3FF
#define LEDC_CH3_GAMMA_RANGE7_SCALE_S  11
/* LEDC_CH3_GAMMA_RANGE7_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH3_GAMMA_RANGE7_DUTY_CYCLE    0x000003FF
#define LEDC_CH3_GAMMA_RANGE7_DUTY_CYCLE_M  ((LEDC_CH3_GAMMA_RANGE7_DUTY_CYCLE_V)<<(LEDC_CH3_GAMMA_RANGE7_DUTY_CYCLE_S))
#define LEDC_CH3_GAMMA_RANGE7_DUTY_CYCLE_V  0x3FF
#define LEDC_CH3_GAMMA_RANGE7_DUTY_CYCLE_S  1
/* LEDC_CH3_GAMMA_RANGE7_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH3_GAMMA_RANGE7_DUTY_INC    (BIT(0))
#define LEDC_CH3_GAMMA_RANGE7_DUTY_INC_M  (BIT(0))
#define LEDC_CH3_GAMMA_RANGE7_DUTY_INC_V  0x1
#define LEDC_CH3_GAMMA_RANGE7_DUTY_INC_S  0

#define LEDC_CH3_GAMMA_RANGE8_REG  (DR_REG_LEDC_BASE + 0x4e0)
/* LEDC_CH3_GAMMA_RANGE8_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH3_GAMMA_RANGE8_DUTY_NUM    0x000003FF
#define LEDC_CH3_GAMMA_RANGE8_DUTY_NUM_M  ((LEDC_CH3_GAMMA_RANGE8_DUTY_NUM_V)<<(LEDC_CH3_GAMMA_RANGE8_DUTY_NUM_S))
#define LEDC_CH3_GAMMA_RANGE8_DUTY_NUM_V  0x3FF
#define LEDC_CH3_GAMMA_RANGE8_DUTY_NUM_S  21
/* LEDC_CH3_GAMMA_RANGE8_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH3_GAMMA_RANGE8_SCALE    0x000003FF
#define LEDC_CH3_GAMMA_RANGE8_SCALE_M  ((LEDC_CH3_GAMMA_RANGE8_SCALE_V)<<(LEDC_CH3_GAMMA_RANGE8_SCALE_S))
#define LEDC_CH3_GAMMA_RANGE8_SCALE_V  0x3FF
#define LEDC_CH3_GAMMA_RANGE8_SCALE_S  11
/* LEDC_CH3_GAMMA_RANGE8_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH3_GAMMA_RANGE8_DUTY_CYCLE    0x000003FF
#define LEDC_CH3_GAMMA_RANGE8_DUTY_CYCLE_M  ((LEDC_CH3_GAMMA_RANGE8_DUTY_CYCLE_V)<<(LEDC_CH3_GAMMA_RANGE8_DUTY_CYCLE_S))
#define LEDC_CH3_GAMMA_RANGE8_DUTY_CYCLE_V  0x3FF
#define LEDC_CH3_GAMMA_RANGE8_DUTY_CYCLE_S  1
/* LEDC_CH3_GAMMA_RANGE8_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH3_GAMMA_RANGE8_DUTY_INC    (BIT(0))
#define LEDC_CH3_GAMMA_RANGE8_DUTY_INC_M  (BIT(0))
#define LEDC_CH3_GAMMA_RANGE8_DUTY_INC_V  0x1
#define LEDC_CH3_GAMMA_RANGE8_DUTY_INC_S  0

#define LEDC_CH3_GAMMA_RANGE9_REG  (DR_REG_LEDC_BASE + 0x4e4)
/* LEDC_CH3_GAMMA_RANGE9_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH3_GAMMA_RANGE9_DUTY_NUM    0x000003FF
#define LEDC_CH3_GAMMA_RANGE9_DUTY_NUM_M  ((LEDC_CH3_GAMMA_RANGE9_DUTY_NUM_V)<<(LEDC_CH3_GAMMA_RANGE9_DUTY_NUM_S))
#define LEDC_CH3_GAMMA_RANGE9_DUTY_NUM_V  0x3FF
#define LEDC_CH3_GAMMA_RANGE9_DUTY_NUM_S  21
/* LEDC_CH3_GAMMA_RANGE9_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH3_GAMMA_RANGE9_SCALE    0x000003FF
#define LEDC_CH3_GAMMA_RANGE9_SCALE_M  ((LEDC_CH3_GAMMA_RANGE9_SCALE_V)<<(LEDC_CH3_GAMMA_RANGE9_SCALE_S))
#define LEDC_CH3_GAMMA_RANGE9_SCALE_V  0x3FF
#define LEDC_CH3_GAMMA_RANGE9_SCALE_S  11
/* LEDC_CH3_GAMMA_RANGE9_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH3_GAMMA_RANGE9_DUTY_CYCLE    0x000003FF
#define LEDC_CH3_GAMMA_RANGE9_DUTY_CYCLE_M  ((LEDC_CH3_GAMMA_RANGE9_DUTY_CYCLE_V)<<(LEDC_CH3_GAMMA_RANGE9_DUTY_CYCLE_S))
#define LEDC_CH3_GAMMA_RANGE9_DUTY_CYCLE_V  0x3FF
#define LEDC_CH3_GAMMA_RANGE9_DUTY_CYCLE_S  1
/* LEDC_CH3_GAMMA_RANGE9_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH3_GAMMA_RANGE9_DUTY_INC    (BIT(0))
#define LEDC_CH3_GAMMA_RANGE9_DUTY_INC_M  (BIT(0))
#define LEDC_CH3_GAMMA_RANGE9_DUTY_INC_V  0x1
#define LEDC_CH3_GAMMA_RANGE9_DUTY_INC_S  0

#define LEDC_CH3_GAMMA_RANGE10_REG  (DR_REG_LEDC_BASE + 0x4e8)
/* LEDC_CH3_GAMMA_RANGE10_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH3_GAMMA_RANGE10_DUTY_NUM    0x000003FF
#define LEDC_CH3_GAMMA_RANGE10_DUTY_NUM_M  ((LEDC_CH3_GAMMA_RANGE10_DUTY_NUM_V)<<(LEDC_CH3_GAMMA_RANGE10_DUTY_NUM_S))
#define LEDC_CH3_GAMMA_RANGE10_DUTY_NUM_V  0x3FF
#define LEDC_CH3_GAMMA_RANGE10_DUTY_NUM_S  21
/* LEDC_CH3_GAMMA_RANGE10_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH3_GAMMA_RANGE10_SCALE    0x000003FF
#define LEDC_CH3_GAMMA_RANGE10_SCALE_M  ((LEDC_CH3_GAMMA_RANGE10_SCALE_V)<<(LEDC_CH3_GAMMA_RANGE10_SCALE_S))
#define LEDC_CH3_GAMMA_RANGE10_SCALE_V  0x3FF
#define LEDC_CH3_GAMMA_RANGE10_SCALE_S  11
/* LEDC_CH3_GAMMA_RANGE10_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH3_GAMMA_RANGE10_DUTY_CYCLE    0x000003FF
#define LEDC_CH3_GAMMA_RANGE10_DUTY_CYCLE_M  ((LEDC_CH3_GAMMA_RANGE10_DUTY_CYCLE_V)<<(LEDC_CH3_GAMMA_RANGE10_DUTY_CYCLE_S))
#define LEDC_CH3_GAMMA_RANGE10_DUTY_CYCLE_V  0x3FF
#define LEDC_CH3_GAMMA_RANGE10_DUTY_CYCLE_S  1
/* LEDC_CH3_GAMMA_RANGE10_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH3_GAMMA_RANGE10_DUTY_INC    (BIT(0))
#define LEDC_CH3_GAMMA_RANGE10_DUTY_INC_M  (BIT(0))
#define LEDC_CH3_GAMMA_RANGE10_DUTY_INC_V  0x1
#define LEDC_CH3_GAMMA_RANGE10_DUTY_INC_S  0

#define LEDC_CH3_GAMMA_RANGE11_REG  (DR_REG_LEDC_BASE + 0x4ec)
/* LEDC_CH3_GAMMA_RANGE11_DUTY_NUM : R/W ;bitpos:[30:21] ;default: 10'h0 ; */
#define LEDC_CH3_GAMMA_RANGE11_DUTY_NUM    0x000003FF
#define LEDC_CH3_GAMMA_RANGE11_DUTY_NUM_M  ((LEDC_CH3_GAMMA_RANGE11_DUTY_NUM_V)<<(LEDC_CH3_GAMMA_RANGE11_DUTY_NUM_S))
#define LEDC_CH3_GAMMA_RANGE11_DUTY_NUM_V  0x3FF
#define LEDC_CH3_GAMMA_RANGE11_DUTY_NUM_S  21
/* LEDC_CH3_GAMMA_RANGE11_SCALE : R/W ;bitpos:[20:11] ;default: 10'h0 ; */
#define LEDC_CH3_GAMMA_RANGE11_SCALE    0x000003FF
#define LEDC_CH3_GAMMA_RANGE11_SCALE_M  ((LEDC_CH3_GAMMA_RANGE11_SCALE_V)<<(LEDC_CH3_GAMMA_RANGE11_SCALE_S))
#define LEDC_CH3_GAMMA_RANGE11_SCALE_V  0x3FF
#define LEDC_CH3_GAMMA_RANGE11_SCALE_S  11
/* LEDC_CH3_GAMMA_RANGE11_DUTY_CYCLE : R/W ;bitpos:[10:1] ;default: 10'h0 ; */
#define LEDC_CH3_GAMMA_RANGE11_DUTY_CYCLE    0x000003FF
#define LEDC_CH3_GAMMA_RANGE11_DUTY_CYCLE_M  ((LEDC_CH3_GAMMA_RANGE11_DUTY_CYCLE_V)<<(LEDC_CH3_GAMMA_RANGE11_DUTY_CYCLE_S))
#define LEDC_CH3_GAMMA_RANGE11_DUTY_CYCLE_V  0x3FF
#define LEDC_CH3_GAMMA_RANGE11_DUTY_CYCLE_S  1
/* LEDC_CH3_GAMMA_RANGE11_DUTY_INC : R/W ;bitpos:[0] ;default: 1'h0 ; */
#define LEDC_CH3_GAMMA_RANGE11_DUTY_INC    (BIT(0))
#define LEDC_CH3_GAMMA_RANGE11_DUTY_INC_M  (BIT(0))
#define LEDC_CH3_GAMMA_RANGE11_DUTY_INC_V  0x1
#define LEDC_CH3_GAMMA_RANGE11_DUTY_INC_S  0

